[
    {
        "id": 1,
        "question": "এই কোর্স কাদের জন্য?",
        "answar": "কোর্সটি সম্পুর্ণ বিগিনারদের জন্য।  আমরা যেহেতু একদম শূন্য থেকে শেখাচ্ছি। তাই কোডিং না পারলেও সমস্যা নেই। এখানে প্রয়োজনীয় কোডিং শেখানো হবে। ওয়েব ডিজাইন নিয়ে হালকা ধারণা থাকলে ভালো। তবে না থাকলেও কোনো অসুবিধা হবে না। আবার যারা আগে থেকেই ওয়েব ডিজাইন পারেন কিন্তু ডিজাইন আইডিয়া মাথায় আসে না তারা এই কোর্সটি ইনরোল করতে পারেন ।"
    },
    {
        "id": 2,
        "question": "কী কী শিখবেন এ কোর্স থেকে?",
        "answar": "একজন ফ্রন্ট-এন্ড ওয়েব ডিজাইনার হয়ে ওঠার জন্য আপনাকে একটি ওয়েবসাইট বা ওয়েব অ্যাপ্লিকেশনের ফ্রন্ট-এন্ড নিয়ে খুব ভালোভাবে জানতে হবে। তাই পুরো কোর্সে আপনি কয়েকটি ধাপে ফ্রন্ট-এন্ড ডিজাইন শেখার সুযোগ পাবেন।"
    },
    {
        "id": 3,
        "question": "কোর্সটি কবে শুরু হবে ? কতদিন চলবে ? ",
        "answar": "নভেম্বরের ১০ তারিখ থেকে ১ম ব্যাচ এর ইন্রোলমেন্ট শুরু হবে  ।  প্রতি সপ্তাহে ৩ টি করে লাইভ ক্লাস ও প্রয়োজনিও রেকর্ডিং ক্লাস থাকবে । কোর্সের সিলেবাস কম্পিল্ট করতে মুটামুটি ৩ মাস সময় লাগবে এবং যারা দুর্বল থাকবে তাদের জন্য আরো ১ মাস স্পেশাল ক্লাসের ব্যবস্থা থাকবে । "
    },
    {
        "id": 4,
        "question": "কেনো এই কোর্সটি করবেন ?",
        "answar": "এই কোর্সটি এমনভাবে সাজানো হয়েছে যাতে একজন বিগিনার সঠিকভাবে তার ওয়েব ডেভেলপমেন্ট এর ক্যারিয়ার শুরু করতে পারে । কোর্সটিতে রয়েছে লাইভ ক্লাসের পাশাপাশি রেকর্ডিং ক্লাস , লাইভ ওয়ান টু ওয়ান সাপোর্ট , এসাইনমেন্ট , লাইভ এসাইনমেন্ট মার্কিং-রিভিউ , লাইভ প্রাক্টিস ক্লাস , এসাইনমেন্ট সল্ভিং ক্লাস ও ফ্রি রিসোর্স সহ আরো এক্সাইটিং অনেক কিছু ।"
    },
    {
        "id": 5,
        "question": "কোর্সের মধ্যে কী কী আছে ?",
        "answar": "সেটা কোর্স সিলেবাস দেখলেই বুঝতে পারবে। বর্তমান সময়ে একজন দক্ষ্য ওয়েব  ডিজাইনার হওয়ার জন্য যা যা লাগে, তার সবই আছে এই কোর্সে। একদম ছোট করে বললে ধরো HTML, CSS থেকে শুরু করে bootstrap , Tailwind , JavaScript, Git, ES6, REST API, server, JSON তো আছেই।"
    },
    {
        "id": 6,
        "question": "কীভাবে রেজিস্টার করবো? পেমেন্ট কি দিয়ে?",
        "answar": "রেজিস্টার করার জন্য জাস্ট ০১৭৫৫৪২৯৫ এই নম্বরে অথবা ০১৭৯০১৭০৭৪৯ এই নম্বরে কল করে তাৎক্ষনিক রেজিস্টার করতে পারবেন অথবা আমাদের ফেইসবুক গ্রুপের এডমিনদের মেসেঞ্জারে নক দিয়ে ও রেজিস্ট্রেশন করে নিতে পারবেন । কোর্স ফি ১০০০ টাকা বিকাশ , নগদ , রকেটে পেমেন্ট করার পর আমরা আপনাকে আপনার ড্যাসবোর্ড এ লগিন করার জন্য আইডি কোড এবং পাসওয়ার্ড দিয়ে দিব।"
    },
    {
        "id": 7,
        "question": "কোর্সটি করার জন্য আগে থেকে কি কি জানতে হবে?",
        "answar": "কোর্সটি করার জন্য বেসিক এইচ.টি.এম.এল, সি.এস.এস, বেসিক জাভাস্ক্রিপ্ট, মডার্ন (>ES6) জাভাস্ক্রিপ্ট, DOM, রিয়্যাক্ট জেএস, npm, Git/GitHub সম্পর্কে ধারণা এবং VSCode এডিটরে কাজ করার অভিজ্ঞতা থাকতে হবে। বিস্তারিত এখান থেকে জানুন।"
    },
    {
        "id": 8,
        "question": "কোর্সের ভিডিওগুলো কিভাবে দেয়া হবে?",
        "answar": "কোর্সের ভিডিওগুলো আগে থেকে রেকোর্ডেড থাকবে। আপনি এনরোল করার পর আপনাকে দেয়া লগইন ইনফরমেশন দিয়ে লগইন করে আপনি ভিডিও গুলো যথা সময়ে দেখতে পারবেন। প্রতি সপ্তাহে 1-2টি মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি ভিডিও থাকবে। এই ভিডিওগুলো আপনাকে সপ্তাহের প্রথম 5 দিনের মধ্যে দেখা শেষ করতে হবে যেন বাকি 2 দিনে মডিউল শেষে দেয়া এসাইনমেন্ট করে জমা দিতে পারেন।"
    },
    {
        "id": 9,
        "question": "কোর্স ফি কি কোর্সের আগে একবারে পুরোটা পরিশোধ করতে হবে?",
        "answar": "হ্যাঁ। কোর্স ফি এককালীন একবারে পুরোটাই কোর্সের শুরুতে পরিশোধ করে দিতে হবে। শুধুমাত্র কোর্স ফি পরিশোধ করার পরই আপনাদের কে লগইন ইনফরমেশন দেয়া হবে। কোন ভাবেই কোর্স ফি বাকি রাখা অথবা এসম্পর্কিত অনুরোধ গৃহীত হবেনা।"
    },
    {
        "id": 10,
        "question": "কোর্স ফি কি ফেরতযোগ্য?",
        "answar": "কোর্স শুরু হয়ে যাবার পর কোর্স ফি কোনভাবেই ফেরতযোগ্য নয়। তবে কোর্স শুরু হয়ে যাবার আগে আপনি আমাদের সাপোর্ট সেন্টারে যোগাযোগ করে কোর্স ফি ফেরত নিতে পারবেন।"
    }
]