import React from 'react';
import FaqAccordion from '../../Components/Child/FaqAccordion';

const Faq = () => {
    let faqs = [
        {
            id: 1,
            question: "কোর্সটি করার জন্য আগে থেকে কি কি জানতে হবে?",
            answar: "কোর্সটি করার জন্য বেসিক এইচ.টি.এম.এল, সি.এস.এস, বেসিক জাভাস্ক্রিপ্ট, মডার্ন (>ES6) জাভাস্ক্রিপ্ট, DOM, রিয়্যাক্ট জেএস, npm, Git/GitHub সম্পর্কে ধারণা এবং VSCode এডিটরে কাজ করার অভিজ্ঞতা থাকতে হবে। বিস্তারিত এখান থেকে জানুন।"
        },
        {
            id: 2,
            question: "কোর্সের ভিডিওগুলো কিভাবে দেয়া হবে ?",
            answar: "কোর্সের ভিডিওগুলো আগে থেকে রেকোর্ডেড থাকবে। আপনি এনরোল করার পর আপনাকে দেয়া লগইন ইনফরমেশন দিয়ে লগইন করে আপনি ভিডিও গুলো যথা সময়ে দেখতে পারবেন। প্রতি সপ্তাহে 1-2টি মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি ভিডিও থাকবে। এই ভিডিওগুলো আপনাকে সপ্তাহের প্রথম 5 দিনের মধ্যে দেখা শেষ করতে হবে যেন বাকি 2 দিনে মডিউল শেষে দেয়া এসাইনমেন্ট করে জমা দিতে পারেন।"
        },
        {
            id: 3,
            question: "কোর্সের ভিডিওগুলো কিভাবে দেয়া হবে ?",
            answar: "কোর্সের ভিডিওগুলো আগে থেকে রেকোর্ডেড থাকবে। আপনি এনরোল করার পর আপনাকে দেয়া লগইন ইনফরমেশন দিয়ে লগইন করে আপনি ভিডিও গুলো যথা সময়ে দেখতে পারবেন। প্রতি সপ্তাহে 1-2টি মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি ভিডিও থাকবে। এই ভিডিওগুলো আপনাকে সপ্তাহের প্রথম 5 দিনের মধ্যে দেখা শেষ করতে হবে যেন বাকি 2 দিনে মডিউল শেষে দেয়া এসাইনমেন্ট করে জমা দিতে পারেন।"
        },
        {
            id: 4,
            question: "কোর্সের ভিডিওগুলো কিভাবে দেয়া হবে ?",
            answar: "কোর্সের ভিডিওগুলো আগে থেকে রেকোর্ডেড থাকবে। আপনি এনরোল করার পর আপনাকে দেয়া লগইন ইনফরমেশন দিয়ে লগইন করে আপনি ভিডিও গুলো যথা সময়ে দেখতে পারবেন। প্রতি সপ্তাহে 1-2টি মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি ভিডিও থাকবে। এই ভিডিওগুলো আপনাকে সপ্তাহের প্রথম 5 দিনের মধ্যে দেখা শেষ করতে হবে যেন বাকি 2 দিনে মডিউল শেষে দেয়া এসাইনমেন্ট করে জমা দিতে পারেন।"
        },
        {
            id: 5,
            question: "কোর্সের ভিডিওগুলো কিভাবে দেয়া হবে ?",
            answar: "কোর্সের ভিডিওগুলো আগে থেকে রেকোর্ডেড থাকবে। আপনি এনরোল করার পর আপনাকে দেয়া লগইন ইনফরমেশন দিয়ে লগইন করে আপনি ভিডিও গুলো যথা সময়ে দেখতে পারবেন। প্রতি সপ্তাহে 1-2টি মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি ভিডিও থাকবে। এই ভিডিওগুলো আপনাকে সপ্তাহের প্রথম 5 দিনের মধ্যে দেখা শেষ করতে হবে যেন বাকি 2 দিনে মডিউল শেষে দেয়া এসাইনমেন্ট করে জমা দিতে পারেন।"
        },
        {
            id: 6,
            question: "কোর্সের ভিডিওগুলো কিভাবে দেয়া হবে ?",
            answar: "কোর্সের ভিডিওগুলো আগে থেকে রেকোর্ডেড থাকবে। আপনি এনরোল করার পর আপনাকে দেয়া লগইন ইনফরমেশন দিয়ে লগইন করে আপনি ভিডিও গুলো যথা সময়ে দেখতে পারবেন। প্রতি সপ্তাহে 1-2টি মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি ভিডিও থাকবে। এই ভিডিওগুলো আপনাকে সপ্তাহের প্রথম 5 দিনের মধ্যে দেখা শেষ করতে হবে যেন বাকি 2 দিনে মডিউল শেষে দেয়া এসাইনমেন্ট করে জমা দিতে পারেন।"
        },
        {
            id: 7,
            question: "কোর্সের ভিডিওগুলো কিভাবে দেয়া হবে ?",
            answar: "কোর্সের ভিডিওগুলো আগে থেকে রেকোর্ডেড থাকবে। আপনি এনরোল করার পর আপনাকে দেয়া লগইন ইনফরমেশন দিয়ে লগইন করে আপনি ভিডিও গুলো যথা সময়ে দেখতে পারবেন। প্রতি সপ্তাহে 1-2টি মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি ভিডিও থাকবে। এই ভিডিওগুলো আপনাকে সপ্তাহের প্রথম 5 দিনের মধ্যে দেখা শেষ করতে হবে যেন বাকি 2 দিনে মডিউল শেষে দেয়া এসাইনমেন্ট করে জমা দিতে পারেন।"
        },
        {
            id: 8,
            question: "কোর্সের ভিডিওগুলো কিভাবে দেয়া হবে ?",
            answar: "কোর্সের ভিডিওগুলো আগে থেকে রেকোর্ডেড থাকবে। আপনি এনরোল করার পর আপনাকে দেয়া লগইন ইনফরমেশন দিয়ে লগইন করে আপনি ভিডিও গুলো যথা সময়ে দেখতে পারবেন। প্রতি সপ্তাহে 1-2টি মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি ভিডিও থাকবে। এই ভিডিওগুলো আপনাকে সপ্তাহের প্রথম 5 দিনের মধ্যে দেখা শেষ করতে হবে যেন বাকি 2 দিনে মডিউল শেষে দেয়া এসাইনমেন্ট করে জমা দিতে পারেন।"
        },
    ]
    return (
        <div className='bg-gray-50 '>
            <div className='pt-12 mb-24 container mx-auto  p-4'>
                <div className='grid lg:grid-cols-2 py-10'>
                    <div className='pl-2 grid items-center'>
                        <div>
                            <img src="https://learnwithsumit.com/_next/static/media/faq.8116aa7d.svg" alt="" />
                            <h2 className="text-4xl font-bold">সচরাচর জানতে চাওয়া <br />
                                <span className='text-[#FFD000]'>প্রশ্নের উত্তর</span></h2>
                            <p>
                                আপনাদের কমন কিছু প্রশ্নের উত্তর আমরা এখানে লিস্ট করে দিয়েছি। আমাদের কে প্রশ্ন করার পূর্বে এই লিস্টটি একবার পড়ে নেয়ার অনুরোধ থাকলো। তাহলে আমাদের উত্তরের জন্য আপনাকে অপেক্ষা করতে হবেনা এবং আপনার মূল্যবান সময় বেঁচে যাবে।
                            </p>
                        </div>
                    </div>
                    {/* Accordion */}
                    <div className='overflow-y-scroll max-h-[450px] pl-2 csbar'>
                        {
                            faqs.map(faq => <FaqAccordion key={faq.id} data={faq} />)
                        }



                    </div>
                </div>
            </div>
        </div>
    );
};

export default Faq;